# Preprocesamiento segundo ejercicio

In [67]:
import numpy as np
import pandas as pd
#vemos como los datos NaN en un principio aparecen como ? por lo tanto llamamos a na_values para cambiar ? por NaN 
#asi con la funcion para ver la cantidad de NaN's si saldria.
datos = pd.read_csv('adult.csv', na_values=['?'])

In [68]:
datos.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,NaN,77053,HS-grad,9,Widowed,NaN,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,NaN,186061,Some-college,10,Widowed,NaN,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K

In [69]:
datos['income'].value_counts()

<=50K    24720
>50K      7841
Name: income, dtype: int64

In [70]:
#cambiar el '<=50k y >50K por 0 y 1 
datos['income'] = [0 if x == '<=50K' else 1 for x in datos['income']]

X = datos.drop('income', axis =1)
y = data.income

In [71]:
X.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week       0
native.country     583
dtype: int64

In [72]:
#vemos como los valores que faltan corresponden con variables categricas es necesatio pasarlo a dummy varable 
#pero antes ver la cantidad de valores en cada columna categorica
datos['workclass'].value_counts()

Private             22696
Self-emp-not-inc     2541
Local-gov            2093
State-gov            1298
Self-emp-inc         1116
Federal-gov           960
Without-pay            14
Never-worked            7
Name: workclass, dtype: int64

In [73]:
datos['occupation'].value_counts()

Prof-specialty       4140
Craft-repair         4099
Exec-managerial      4066
Adm-clerical         3770
Sales                3650
Other-service        3295
Machine-op-inspct    2002
Transport-moving     1597
Handlers-cleaners    1370
Farming-fishing       994
Tech-support          928
Protective-serv       649
Priv-house-serv       149
Armed-Forces            9
Name: occupation, dtype: int64

In [74]:
datos['native.country'].value_counts()

United-States                 29170
Mexico                          643
Philippines                     198
Germany                         137
Canada                          121
Puerto-Rico                     114
El-Salvador                     106
India                           100
Cuba                             95
England                          90
Jamaica                          81
South                            80
China                            75
Italy                            73
Dominican-Republic               70
Vietnam                          67
Guatemala                        64
Japan                            62
Poland                           60
Columbia                         59
Taiwan                           51
Haiti                            44
Iran                             43
Portugal                         37
Nicaragua                        34
Peru                             31
France                           29
Greece                           29
Ecuador                          28
Ireland                          24
Hong                             20
Trinadad&Tobago                  19
Cambodia                         19
Laos                             18
Thailand                         18
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Hungary                          13
Honduras                         13
Scotland                         12
Holand-Netherlands                1
Name: native.country, dtype: int64

In [75]:
#si hacemos un dummy variable por cada valor en la columna de native country seria interminable el dataframe lo que haremos 
#es agrupar todo en dos categorias como en eeuu supera con creces pues se hara una de eeuu y otra con otros_paises
datos['native.country']=['United-States' if x == 'United-States' else 'Other'for x in datos['native.country']]
datos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         30725 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education.num     32561 non-null int64
marital.status    32561 non-null object
occupation        30718 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital.gain      32561 non-null int64
capital.loss      32561 non-null int64
hours.per.week    32561 non-null int64
native.country    32561 non-null object
income            32561 non-null int64
dtypes: int64(7), object(8)
memory usage: 3.7+ MB

In [76]:
#ahora creamos los dummy variables 
def dummy(datos):
    for i in datos.columns:
        if datos[i].dtype =='O':
            datos = pd.concat([datos,pd.get_dummies(datos[i],prefix=i)],axis = 1)
            del datos[i]
    return datos

In [77]:
dato = dummy(datos)

In [78]:
dato.isnull().sum().sort_values(ascending=False).head()

native.country_United-States    0
education_11th                  0
education_Some-college          0
education_Prof-school           0
education_Preschool             0
dtype: int64